Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ1025DAH176.atdf
      <value-group caption="Internal DDRV" name="CFGMPLL__INTVREFCON">
         <value caption="Enable the internal DDRV" name="INTERNAL_DDRV" value="0x3" />
         <value caption="Disable the internal DDRV and drive the DDRVREF pin to VSS1V8" name="INTERNAL_DIS_VSS1V8" value="0x2" />
         <value caption="Disable the internal DDRV and drive the DDRVREF pin to VDDR1V8" name="INTERNAL_DIS_VDDR1V8" value="0x1" />
         <value caption="Use the external DDRV" name="EXTERNAL_DDRV" value="0x0" />
      </value-group>
      <value-group caption="MPLL Multiplier bits" name="CFGMPLL__MPLLMULT">
         <value caption="Reserved" name="RESERVED" value="0xff" />
         <value caption="Reserved" name="RESERVED" value="0xfe" />
         <value caption="Reserved" name="RESERVED" value="0xFD" />
         <value caption="Reserved" name="RESERVED" value="0xFC" />
         <value caption="Reserved" name="RESERVED" value="0xFB" />
         <value caption="Reserved" name="RESERVED" value="0xFA" />
         <value caption="Reserved" name="RESERVED" value="0xF9" />
         <value caption="Reserved" name="RESERVED" value="0xF8" />
         <value caption="Reserved" name="RESERVED" value="0xF7" />
         <value caption="Reserved" name="RESERVED" value="0xF6" />
         <value caption="Reserved" name="RESERVED" value="0xF5" />
         <value caption="Reserved" name="RESERVED" value="0xF4" />
         <value caption="Reserved" name="RESERVED" value="0xF3" />
         <value caption="Reserved" name="RESERVED" value="0xF2" />
         <value caption="Reserved" name="RESERVED" value="0xF1" />
         <value caption="Reserved" name="RESERVED" value="0xF0" />
         <value caption="Reserved" name="RESERVED" value="0xEF" />
         <value caption="Reserved" name="RESERVED" value="0xEE" />
         <value caption="Reserved" name="RESERVED" value="0xED" />
         <value caption="Reserved" name="RESERVED" value="0xEC" />
         <value caption="Reserved" name="RESERVED" value="0xEB" />
         <value caption="Reserved" name="RESERVED" value="0xEA" />
         <value caption="Reserved" name="RESERVED" value="0xE9" />
         <value caption="Reserved" name="RESERVED" value="0xE8" />
         <value caption="Reserved" name="RESERVED" value="0xE7" />
         <value caption="Reserved" name="RESERVED" value="0xE6" />
         <value caption="Reserved" name="RESERVED" value="0xE5" />
         <value caption="Reserved" name="RESERVED" value="0xE4" />
         <value caption="Reserved" name="RESERVED" value="0xE3" />
         <value caption="Reserved" name="RESERVED" value="0xE2" />
         <value caption="Reserved" name="RESERVED" value="0xE1" />
         <value caption="Reserved" name="RESERVED" value="0xE0" />
         <value caption="Reserved" name="RESERVED" value="0xDF" />
         <value caption="Reserved" name="RESERVED" value="0xDE" />
         <value caption="Reserved" name="RESERVED" value="0xDD" />
         <value caption="Reserved" name="RESERVED" value="0xDC" />
         <value caption="Reserved" name="RESERVED" value="0xDB" />
         <value caption="Reserved" name="RESERVED" value="0xDA" />
         <value caption="Reserved" name="RESERVED" value="0xD9" />
         <value caption="Reserved" name="RESERVED" value="0xD8" />
         <value caption="Reserved" name="RESERVED" value="0xD7" />
         <value caption="Reserved" name="RESERVED" value="0xD6" />
         <value caption="Reserved" name="RESERVED" value="0xD5" />
         <value caption="Reserved" name="RESERVED" value="0xD4" />
         <value caption="Reserved" name="RESERVED" value="0xD3" />
         <value caption="Reserved" name="RESERVED" value="0xD2" />
         <value caption="Reserved" name="RESERVED" value="0xD1" />
         <value caption="Reserved" name="RESERVED" value="0xD0" />
         <value caption="Reserved" name="RESERVED" value="0xCF" />
         <value caption="Reserved" name="RESERVED" value="0xCE" />
         <value caption="Reserved" name="RESERVED" value="0xCD" />
         <value caption="Reserved" name="RESERVED" value="0xCC" />
         <value caption="Reserved" name="RESERVED" value="0xCB" />
         <value caption="Reserved" name="RESERVED" value="0xCA" />
         <value caption="Reserved" name="RESERVED" value="0xC9" />
         <value caption="Reserved" name="RESERVED" value="0xC8" />
         <value caption="Reserved" name="RESERVED" value="0xC7" />
         <value caption="Reserved" name="RESERVED" value="0xC6" />
         <value caption="Reserved" name="RESERVED" value="0xC5" />
         <value caption="Reserved" name="RESERVED" value="0xC4" />
         <value caption="Reserved" name="RESERVED" value="0xC3" />
         <value caption="Reserved" name="RESERVED" value="0xC2" />
         <value caption="Reserved" name="RESERVED" value="0xC1" />
         <value caption="Reserved" name="RESERVED" value="0xC0" />
         <value caption="Reserved" name="RESERVED" value="0xBF" />
         <value caption="Reserved" name="RESERVED" value="0xBE" />
         <value caption="Reserved" name="RESERVED" value="0xBD" />
         <value caption="Reserved" name="RESERVED" value="0xBC" />
         <value caption="Reserved" name="RESERVED" value="0xBB" />
         <value caption="Reserved" name="RESERVED" value="0xBA" />
         <value caption="Reserved" name="RESERVED" value="0xB9" />
         <value caption="Reserved" name="RESERVED" value="0xB8" />
         <value caption="Reserved" name="RESERVED" value="0xB7" />
         <value caption="Reserved" name="RESERVED" value="0xB6" />
         <value caption="Reserved" name="RESERVED" value="0xB5" />
         <value caption="Reserved" name="RESERVED" value="0xB4" />
         <value caption="Reserved" name="RESERVED" value="0xB3" />
         <value caption="Reserved" name="RESERVED" value="0xB2" />
         <value caption="Reserved" name="RESERVED" value="0xB1" />
         <value caption="Reserved" name="RESERVED" value="0xB0" />
         <value caption="Reserved" name="RESERVED" value="0xAF" />
         <value caption="Reserved" name="RESERVED" value="0xAE" />
         <value caption="Reserved" name="RESERVED" value="0xAD" />
         <value caption="Reserved" name="RESERVED" value="0xAC" />
         <value caption="Reserved" name="RESERVED" value="0xAB" />
         <value caption="Reserved" name="RESERVED" value="0xAA" />
         <value caption="Reserved" name="RESERVED" value="0xA9" />
         <value caption="Reserved" name="RESERVED" value="0xA8" />
         <value caption="Reserved" name="RESERVED" value="0xA7" />
         <value caption="Reserved" name="RESERVED" value="0xA6" />
         <value caption="Reserved" name="RESERVED" value="0xA5" />
         <value caption="Reserved" name="RESERVED" value="0xA4" />
         <value caption="Reserved" name="RESERVED" value="0xA3" />
         <value caption="Reserved" name="RESERVED" value="0xA2" />
         <value caption="Reserved" name="RESERVED" value="0xa1" />
         <value caption="Multiply by 160" name="MUL_160" value="0xa0" />
         <value caption="Multiply by 159" name="MUL_159" value="0x9f" />
         <value caption="Multiply by 158" name="MUL_158" value="0x9E" />
         <value caption="Multiply by 157" name="MUL_157" value="0x9D" />
         <value caption="Multiply by 156" name="MUL_156" value="0x9C" />
         <value caption="Multiply by 155" name="MUL_155" value="0x9B" />
         <value caption="Multiply by 154" name="MUL_154" value="0x9A" />
         <value caption="Multiply by 153" name="MUL_153" value="0x99" />
         <value caption="Multiply by 152" name="MUL_152" value="0x98" />
         <value caption="Multiply by 151" name="MUL_151" value="0x97" />
         <value caption="Multiply by 150" name="MUL_150" value="0x96" />
         <value caption="Multiply by 149" name="MUL_149" value="0x95" />
         <value caption="Multiply by 148" name="MUL_148" value="0x94" />
         <value caption="Multiply by 147" name="MUL_147" value="0x93" />
         <value caption="Multiply by 146" name="MUL_146" value="0x92" />
         <value caption="Multiply by 145" name="MUL_145" value="0x91" />
         <value caption="Multiply by 144" name="MUL_144" value="0x90" />
         <value caption="Multiply by 143" name="MUL_143" value="0x8F" />
         <value caption="Multiply by 142" name="MUL_142" value="0x8E" />
         <value caption="Multiply by 141" name="MUL_141" value="0x8D" />
         <value caption="Multiply by 140" name="MUL_140" value="0x8C" />
         <value caption="Multiply by 139" name="MUL_139" value="0x8B" />
         <value caption="Multiply by 138" name="MUL_138" value="0x8A" />
         <value caption="Multiply by 137" name="MUL_137" value="0x89" />
         <value caption="Multiply by 136" name="MUL_136" value="0x88" />
         <value caption="Multiply by 135" name="MUL_135" value="0x87" />
         <value caption="Multiply by 134" name="MUL_134" value="0x86" />
         <value caption="Multiply by 133" name="MUL_133" value="0x85" />
         <value caption="Multiply by 132" name="MUL_132" value="0x84" />
         <value caption="Multiply by 131" name="MUL_131" value="0x83" />
         <value caption="Multiply by 130" name="MUL_130" value="0x82" />
         <value caption="Multiply by 129" name="MUL_129" value="0x81" />
         <value caption="Multiply by 128" name="MUL_128" value="0x80" />
         <value caption="Multiply by 127" name="MUL_127" value="0x7F" />
         <value caption="Multiply by 126" name="MUL_126" value="0x7E" />
         <value caption="Multiply by 125" name="MUL_125" value="0x7D" />
         <value caption="Multiply by 124" name="MUL_124" value="0x7C" />
         <value caption="Multiply by 123" name="MUL_123" value="0x7B" />
         <value caption="Multiply by 122" name="MUL_122" value="0x7A" />
         <value caption="Multiply by 121" name="MUL_121" value="0x79" />
         <value caption="Multiply by 120" name="MUL_120" value="0x78" />
         <value caption="Multiply by 119" name="MUL_119" value="0x77" />
         <value caption="Multiply by 118" name="MUL_118" value="0x76" />
         <value caption="Multiply by 117" name="MUL_117" value="0x75" />
         <value caption="Multiply by 116" name="MUL_116" value="0x74" />
         <value caption="Multiply by 115" name="MUL_115" value="0x73" />
         <value caption="Multiply by 114" name="MUL_114" value="0x72" />
         <value caption="Multiply by 113" name="MUL_113" value="0x71" />
         <value caption="Multiply by 112" name="MUL_112" value="0x70" />
         <value caption="Multiply by 111" name="MUL_111" value="0x6F" />
         <value caption="Multiply by 110" name="MUL_110" value="0x6E" />
         <value caption="Multiply by 109" name="MUL_109" value="0x6D" />
         <value caption="Multiply by 108" name="MUL_108" value="0x6C" />
         <value caption="Multiply by 107" name="MUL_107" value="0x6B" />
         <value caption="Multiply by 106" name="MUL_106" value="0x6A" />
         <value caption="Multiply by 105" name="MUL_105" value="0x69" />
         <value caption="Multiply by 104" name="MUL_104" value="0x68" />
         <value caption="Multiply by 103" name="MUL_103" value="0x67" />
         <value caption="Multiply by 102" name="MUL_102" value="0x66" />
         <value caption="Multiply by 101" name="MUL_101" value="0x65" />
         <value caption="Multiply by 100" name="MUL_100" value="0x64" />
         <value caption="Multiply by 99" name="MUL_99" value="0x63" />
         <value caption="Multiply by 98" name="MUL_98" value="0x62" />
         <value caption="Multiply by 97" name="MUL_97" value="0x61" />
         <value caption="Multiply by 96" name="MUL_96" value="0x60" />
         <value caption="Multiply by 95" name="MUL_95" value="0x5F" />
         <value caption="Multiply by 94" name="MUL_94" value="0x5E" />
         <value caption="Multiply by 93" name="MUL_93" value="0x5D" />
         <value caption="Multiply by 92" name="MUL_92" value="0x5C" />
         <value caption="Multiply by 91" name="MUL_91" value="0x5B" />
         <value caption="Multiply by 90" name="MUL_90" value="0x5A" />
         <value caption="Multiply by 89" name="MUL_89" value="0x59" />
         <value caption="Multiply by 88" name="MUL_88" value="0x58" />
         <value caption="Multiply by 87" name="MUL_87" value="0x57" />
         <value caption="Multiply by 86" name="MUL_86" value="0x56" />
         <value caption="Multiply by 85" name="MUL_85" value="0x55" />
         <value caption="Multiply by 84" name="MUL_84" value="0x54" />
         <value caption="Multiply by 83" name="MUL_83" value="0x53" />
         <value caption="Multiply by 82" name="MUL_82" value="0x52" />
         <value caption="Multiply by 81" name="MUL_81" value="0x51" />
         <value caption="Multiply by 80" name="MUL_80" value="0x50" />
         <value caption="Multiply by 79" name="MUL_79" value="0x4F" />
         <value caption="Multiply by 78" name="MUL_78" value="0x4E" />
         <value caption="Multiply by 77" name="MUL_77" value="0x4D" />
         <value caption="Multiply by 76" name="MUL_76" value="0x4C" />
         <value caption="Multiply by 75" name="MUL_75" value="0x4B" />
         <value caption="Multiply by 74" name="MUL_74" value="0x4A" />
         <value caption="Multiply by 73" name="MUL_73" value="0x49" />
         <value caption="Multiply by 72" name="MUL_72" value="0x48" />
         <value caption="Multiply by 71" name="MUL_71" value="0x47" />
         <value caption="Multiply by 70" name="MUL_70" value="0x46" />
         <value caption="Multiply by 69" name="MUL_69" value="0x45" />
         <value caption="Multiply by 68" name="MUL_68" value="0x44" />
         <value caption="Multiply by 67" name="MUL_67" value="0x43" />
         <value caption="Multiply by 66" name="MUL_66" value="0x42" />
         <value caption="Multiply by 65" name="MUL_65" value="0x41" />
         <value caption="Multiply by 64" name="MUL_64" value="0x40" />
         <value caption="Multiply by 63" name="MUL_63" value="0x3F" />
         <value caption="Multiply by 62" name="MUL_62" value="0x3E" />
         <value caption="Multiply by 61" name="MUL_61" value="0x3D" />
         <value caption="Multiply by 60" name="MUL_60" value="0x3C" />
         <value caption="Multiply by 59" name="MUL_59" value="0x3B" />
         <value caption="Multiply by 58" name="MUL_58" value="0x3A" />
         <value caption="Multiply by 57" name="MUL_57" value="0x39" />
         <value caption="Multiply by 56" name="MUL_56" value="0x38" />
         <value caption="Multiply by 55" name="MUL_55" value="0x37" />
         <value caption="Multiply by 54" name="MUL_54" value="0x36" />
         <value caption="Multiply by 53" name="MUL_53" value="0x35" />
         <value caption="Multiply by 52" name="MUL_52" value="0x34" />
         <value caption="Multiply by 51" name="MUL_51" value="0x33" />
         <value caption="Multiply by 50" name="MUL_50" value="0x32" />
         <value caption="Multiply by 49" name="MUL_49" value="0x31" />
         <value caption="Multiply by 48" name="MUL_48" value="0x30" />
         <value caption="Multiply by 47" name="MUL_47" value="0x2F" />
         <value caption="Multiply by 46" name="MUL_46" value="0x2E" />
         <value caption="Multiply by 45" name="MUL_45" value="0x2D" />
         <value caption="Multiply by 44" name="MUL_44" value="0x2C" />
         <value caption="Multiply by 43" name="MUL_43" value="0x2B" />
         <value caption="Multiply by 42" name="MUL_42" value="0x2A" />
         <value caption="Multiply by 41" name="MUL_41" value="0x29" />
         <value caption="Multiply by 40" name="MUL_40" value="0x28" />
         <value caption="Multiply by 39" name="MUL_39" value="0x27" />
         <value caption="Multiply by 38" name="MUL_38" value="0x26" />
         <value caption="Multiply by 37" name="MUL_37" value="0x25" />
         <value caption="Multiply by 36" name="MUL_36" value="0x24" />
         <value caption="Multiply by 35" name="MUL_35" value="0x23" />
         <value caption="Multiply by 34" name="MUL_34" value="0x22" />
         <value caption="Multiply by 33" name="MUL_33" value="0x21" />
         <value caption="Multiply by 32" name="MUL_32" value="0x20" />
         <value caption="Multiply by 31" name="MUL_31" value="0x1F" />
         <value caption="Multiply by 30" name="MUL_30" value="0x1E" />
         <value caption="Multiply by 29" name="MUL_29" value="0x1D" />
         <value caption="Multiply by 28" name="MUL_28" value="0x1C" />
         <value caption="Multiply by 27" name="MUL_27" value="0x1B" />
         <value caption="Multiply by 26" name="MUL_26" value="0x1A" />
         <value caption="Multiply by 25" name="MUL_25" value="0x19" />
         <value caption="Multiply by 24" name="MUL_24" value="0x18" />
         <value caption="Multiply by 23" name="MUL_23" value="0x17" />
         <value caption="Multiply by 22" name="MUL_22" value="0x16" />
         <value caption="Multiply by 21" name="MUL_21" value="0x15" />
         <value caption="Multiply by 20" name="MUL_20" value="0x14" />
         <value caption="Multiply by 19" name="MUL_19" value="0x13" />
         <value caption="Multiply by 18" name="MUL_18" value="0x12" />
         <value caption="Multiply by 17" name="MUL_17" value="0x11" />
         <value caption="Multiply by 16" name="MUL_16" value="0x10" />
         <value caption="Reserved" name="RESERVED" value="0xE" />
         <value caption="Reserved" name="RESERVED" value="0xD" />
         <value caption="Reserved" name="RESERVED" value="0xC" />
         <value caption="Reserved" name="RESERVED" value="0xB" />
         <value caption="Reserved" name="RESERVED" value="0xA" />
         <value caption="Reserved" name="RESERVED" value="0x9" />
         <value caption="Reserved" name="RESERVED" value="0x8" />
         <value caption="Reserved" name="RESERVED" value="0x7" />
         <value caption="Reserved" name="RESERVED" value="0x6" />
         <value caption="Reserved" name="RESERVED" value="0x5" />
         <value caption="Reserved" name="RESERVED" value="0x4" />
         <value caption="Reserved" name="RESERVED" value="0x3" />
         <value caption="Reserved" name="RESERVED" value="0x2" />
         <value caption="Reserved" name="RESERVED" value="0x1" />
         <value caption="Reserved" name="RESERVED" value="0xf" />
         <value caption="Reserved" name="RESERVED" value="0x0" />
      </value-group>
      <value-group caption="MPLL Voltage regulator Disable bit" name="CFGMPLL__MPLLVREGDIS">
         <value caption="MPLL voltage regulator is disabled" name="DISABLED" value="0x1" />
         <value caption="MPLL voltage regulator is enabled" name="ENABLED" value="0x0" />
      </value-group>
      <value-group caption="MPLL Voltage Regulator Ready bit" name="CFGMPLL__MPLLVREGRDY">
         <value caption="MPLL voltage regulator is ready for use" name="" value="0x1" />
         <value caption="MPLL voltage regulator is not ready or is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="MPLL Output Divider 2 bits" name="CFGMPLL__MPLLODIV2">
         <value caption="MPLL second stage output is divided by 7" name="DIV_7" value="0x7" />
         <value caption="MPLL second stage output is divided by 6" name="DIV_6" value="0x6" />
         <value caption="MPLL second stage output is divided by 5" name="DIV_5" value="0x5" />
         <value caption="MPLL second stage output is divided by 4" name="DIV_4" value="0x4" />
         <value caption="MPLL second stage output is divided by 3" name="DIV_3" value="0x3" />
         <value caption="MPLL second stage output is divided by 2" name="DIV_2" value="0x2" />
         <value caption="MPLL second stage output is divided by 1" name="DIV_1" value="0x1" />
         <value caption="Reserved" name="Reserved" value="0x0" />
      </value-group>
      <value-group caption="MPLL Output Divider 1 bits" name="CFGMPLL__MPLLODIV1">
         <value caption="MPLL second stage output is divided by 7" name="DIV_7" value="0x7" />
         <value caption="MPLL second stage output is divided by 6" name="DIV_6" value="0x6" />
         <value caption="MPLL second stage output is divided by 5" name="DIV_5" value="0x5" />
         <value caption="MPLL second stage output is divided by 4" name="DIV_4" value="0x4" />
         <value caption="MPLL second stage output is divided by 3" name="DIV_3" value="0x3" />
         <value caption="MPLL second stage output is divided by 2" name="DIV_2" value="0x2" />
         <value caption="MPLL second stage output is divided by 1" name="DIV_1" value="0x1" />
         <value caption="Reserved" name="Reserved" value="0x0" />
      </value-group>
      <value-group caption="MPLL Disable bit" name="CFGMPLL__MPLLDIS">
         <value caption="MPLL is disabled" name="DISABLED" value="0x1" />
         <value caption="MPLL is enabled" name="ENABLED" value="0x0" />
      </value-group>
