Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ1025DAH176.atdf
      <value-group caption="CVref Range Selection bit" name="CVRCON__CVRR">
         <value caption="0 to 0.67 CVrsrc" name="" value="0x1" />
         <value caption="0.25 CVrsrc to 0.75 CVrsrc" name="" value="0x0" />
      </value-group>
      <value-group caption="CVrefout Enable bit" name="CVRCON__CVROE">
         <value caption="Voltage level is output on CVrefout pin" name="" value="0x1" />
         <value caption="Voltage level is disconnected from CVrefout pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Voltage Reference On bit" name="CVRCON__ON">
         <value caption="Module is enabled. Setting this bit does not affect other bits in the register." name="" value="0x1" />
         <value caption="Module is disabled and does not consume current. Clearing this bit does not affect the other bits in the register." name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00184" name="DDR" version="1">
      <register-group name="DDR">
         <register caption="DDR Target Select Register" name="DDRTSEL" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="TSEL" />
         </register>
         <register caption="DDR Minimum Burst Limit Register" name="DDRMINLIM" offset="0x4" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="MINLIMIT" />
         </register>
         <register caption="DDR Request Period Register" name="DDRRQPER" offset="0x8" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="RQPER" />
         </register>
         <register caption="DDR Minimum Command Register" name="DDRMINCMD" offset="0xc" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="MINCMD" />
         </register>
         <register caption="DDR Memory Control Register" name="DDRMEMCON" offset="0x10" rw="RW" size="4">
            <bitfield caption="Memory Initialize Start bit" mask="0x00000001" name="STINIT" values="DDRMEMCON__STINIT" />
            <bitfield caption="Memory Initialize Done bit" mask="0x00000002" name="INITDN" values="DDRMEMCON__INITDN" />
         </register>
         <register caption="DDR Memory Configuration Register 0" name="DDRMEMCFG0" offset="0x14" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RWADDR" />
            <bitfield mask="0x00001F00" name="BNKADDR" />
            <bitfield mask="0x001F0000" name="CSADDR" />
            <bitfield mask="0x1F000000" name="CLHADDR" />
            <bitfield caption="Automatic Precharge Enable bit" mask="0x40000000" name="APCHRGEN" values="DDRMEMCFG0__APCHRGEN" />
         </register>
         <register caption="DDR Memory Configuration Register 1" name="DDRMEMCFG1" offset="0x18" rw="RW" size="4">
            <bitfield mask="0x00001FFF" name="RWADDRMSK" />
         </register>
         <register caption="DDR Memory Configuration Register 2" name="DDRMEMCFG2" offset="0x1c" rw="RW" size="4">
            <bitfield mask="0x00001FFF" name="CLADDRHMSK" />
         </register>
         <register caption="DDR Memory Configuration Register 3" name="DDRMEMCFG3" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x00001FFF" name="CLADDRLMSK" />
         </register>
         <register caption="DDR Memory Configuration Register 4" name="DDRMEMCFG4" offset="0x24" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="BNKADDRMSK" />
            <bitfield mask="0x00001F00" name="CSADDRMSK" />
         </register>
         <register caption="DDR Refresh Configuration Register" name="DDRREFCFG" offset="0x28" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="REFCNT" />
            <bitfield mask="0x00FF0000" name="REFDLY" />
            <bitfield mask="0x07000000" name="MAXREFS" />
         </register>
         <register caption="DDR Power Configuration Register" name="DDRPWRCFG" offset="0x2c" rw="RW" size="4">
            <bitfield caption="Automatic Power Down Enable bit" mask="0x00000004" name="APWRDNEN" values="DDRPWRCFG__APWRDNEN" />
            <bitfield caption="Automatic Self Refresh Enable bit" mask="0x00000008" name="ASLFREFEN" values="DDRPWRCFG__ASLFREFEN" />
            <bitfield caption="Refresh Count bits" mask="0x00000FF0" name="PWRDNDLY" values="DDRPWRCFG__PWRDNDLY" />
            <bitfield caption="Self Refresh Delay bits" mask="0x003FF000" name="SLFREFDLY" values="DDRPWRCFG__SLFREFDLY" />
            <bitfield caption="Precharge Power Down Only bit" mask="0x00400000" name="PCHRGPWRDN" values="DDRPWRCFG__PCHRGPWRDN" />
         </register>
         <register caption="DDR Delay Configuration Register 0" name="DDRDLYCFG0" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="W2RDLY" />
            <bitfield mask="0x000000F0" name="W2RCSDLY" />
            <bitfield mask="0x00000F00" name="R2RDLY" />
            <bitfield mask="0x0000F000" name="R2RCSDLY" />
            <bitfield mask="0x000F0000" name="W2WDLY" />
            <bitfield mask="0x00F00000" name="W2WCSDLY" />
            <bitfield mask="0x0F000000" name="R2WDLY" />
            <bitfield mask="0xF0000000" name="RMWDLY" />
         </register>
         <register caption="DDR Delay Configuration Register 1" name="DDRDLYCFG1" offset="0x34" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="SLFREFMINDLY" />
            <bitfield mask="0x0000FF00" name="SLFREFEXDLY" />
            <bitfield mask="0x000F0000" name="PWRDNMINDLY" />
            <bitfield mask="0x03F00000" name="PWRDNEXDLY" />
            <bitfield mask="0x04000000" name="W2PCHRGDLY4" />
            <bitfield mask="0x08000000" name="W2RDLY4" />
            <bitfield mask="0x10000000" name="W2RCSDLY4" />
            <bitfield mask="0x20000000" name="NXTDATAVDLY4" />
            <bitfield mask="0x40000000" name="SLFREFEXDLY8" />
         </register>
         <register caption="DDR Delay Configuration Register 2" name="DDRDLYCFG2" offset="0x38" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PCHRGALLDLY" />
            <bitfield mask="0x00000F00" name="R2PCHRGDLY" />
            <bitfield mask="0x0000F000" name="W2PCHRGDLY" />
            <bitfield mask="0x000F0000" name="RAS2RASDLY" />
            <bitfield mask="0x00F00000" name="RAS2CASDLY" />
            <bitfield mask="0x0F000000" name="PCHRG2RASDLY" />
            <bitfield mask="0xF0000000" name="RBENDDLY" />
         </register>
         <register caption="DDR Delay Configuration Register 3" name="DDRDLYCFG3" offset="0x3c" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RAS2PCHRGDLY" />
            <bitfield mask="0x00003F00" name="RAS2RASSBNKDLY" />
            <bitfield mask="0x003F0000" name="FAWTDLY" />
         </register>
         <register caption="DDR On-Die Termination Configuration Register" name="DDRODTCFG" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="ODTCSEN" />
            <bitfield mask="0x00000F00" name="ODTRDLY" />
            <bitfield mask="0x0000F000" name="ODTWDLY" />
            <bitfield mask="0x00070000" name="ODTRLEN" />
            <bitfield mask="0x00700000" name="ODTWLEN" />
         </register>
